import React from "react";

const DataPrivacyPage = () => {
  return (
    <div className="w-full h-full px-40 pt-navbar">
      <h1 className="text-2xl font-bold mb-4 text-center">
        นโยบายความเป็นส่วนตัว (Privacy Policy) สำหรับแนบใน Google Play และ App
        Store แอปพลิเคชัน: หางาน tempjobอัปเดตล่าสุด: 14 พฤษภาคม 2568
      </h1>
      <p>
        เราตระหนักถึงความสำคัญของความเป็นส่วนตัวของผู้ใช้ &quot;หางาน tempjob&quot;
        แอปของเราจัดทำขึ้นเพื่ออำนวยความสะดวกแก่ผู้หางานและนายจ้าง
        โดยเราให้ความสำคัญกับการเก็บรักษาและใช้ข้อมูลส่วนบุคคลของท่านอย่างเหมาะสมและปลอดภัย
      </p>
      <ul className="list-disc pl-5">
        <li>
          1. ข้อมูลที่เราเก็บรวบรวม เมื่อท่านใช้งานแอป &quot;หางาน tempjob&quot;
          เราจะทำการเก็บรวบรวมข้อมูลดังต่อไปนี้: ข้อมูลส่วนตัว เช่น
          ชื่อ-นามสกุล, วันเกิด, เพศ, สัญชาติ, ศาสนา, ที่อยู่ ข้อมูลการติดต่อ
          เช่น อีเมล, เบอร์โทรศัพท์ ข้อมูลการศึกษา เช่น วุฒิการศึกษา, สาขาวิชา
          ข้อมูลเกี่ยวกับใบขับขี่ (ถ้ามี) ข้อมูลรูปถ่ายจากอัลบั้มในมือถือ
          (สำหรับโปรไฟล์) ข้อมูลอื่นๆ เพื่อประกอบการใช้งาน
        </li>
        2. วัตถุประสงค์ของการเก็บข้อมูล
        เราใช้ข้อมูลของท่านเพื่อวัตถุประสงค์ดังต่อไปนี้:
        สร้างโปรไฟล์ผู้สมัครเพื่อใช้หางาน อำนวยความสะดวกในการสมัครงานผ่านแอป
        ให้บริษัทที่ลงทะเบียนกับ tempjob
        <li>
          {" "}
          3. การเข้าถึงและควบคุมข้อมูล ท่านสามารถแก้ไข
          ข้อมูลของท่านได้ทุกเมื่อผ่านแอปพลิเคชัน หากต้องการลบบัญชีผู้ใช้งาน
          กรุณาติดต่อทีมงานผ่านอีเมล tempjob.cs@gmail.com{" "}
          สามารถค้นหาข้อมูลของท่านได้เพื่อนำไปพิจารณาการจ้างงาน
        </li>
        <li>
          4. การเปิดเผยข้อมูลต่อบุคคลที่สาม เราจะไม่ขาย แลกเปลี่ยน
          หรือเผยแพร่ข้อมูลของท่านให้แก่บุคคลภายนอก
          ยกเว้นในกรณีที่นายจ้างซึ่งลงทะเบียนกับ tempjob
          ต้องการดูข้อมูลของผู้สมัคร{" "}
        </li>
        <li>
          5. ความปลอดภัยของข้อมูล เรามีมาตรการในการปกป้องข้อมูลของท่าน
          โดยใช้การเข้ารหัสข้อมูลและระบบฐานข้อมูลที่ปลอดภัย
        </li>
        <li>
          6. การเปลี่ยนแปลงนโยบาย เราอาจปรับปรุงนโยบายฉบับนี้เป็นครั้งคราว
          โดยจะแจ้งเตือนผ่านแอปเมื่อมีการเปลี่ยนแปลง{" "}
        </li>
        <li>
          7. การติดต่อ หากท่านมีคำถามเกี่ยวกับนโยบายความเป็นส่วนตัวนี้
          กรุณาติดต่อทีมงานผ่านอีเมล tempjob.cs@gmail.com
        </li>
      </ul>
    </div>
  );
};

export default DataPrivacyPage;